CSI API ETABS v1
cDesignConcreteSlab.GetFlexureAndShear Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetFlexureAndShear(
	ref string[] StoryName,
	ref string[] DesignStripName,
	ref double[] Station,
	ref double[] ConcWidth,
	ref string[] FTopCombo,
	ref double[] FTopMoment,
	ref double[] FTopArea,
	ref double[] FTopAMin,
	ref string[] FBotCombo,
	ref double[] FBotMoment,
	ref double[] FBotArea,
	ref double[] FBotAMin,
	ref double[] AxialForce,
	ref string[] VCombo,
	ref double[] VForce,
	ref double[] VArea,
	ref string[] Status,
	ref double[] GlobalX,
	ref double[] GlobalY,
	ref string[] Layer
)
Function GetFlexureAndShear (
	ByRef StoryName As String(),
	ByRef DesignStripName As String(),
	ByRef Station As Double(),
	ByRef ConcWidth As Double(),
	ByRef FTopCombo As String(),
	ByRef FTopMoment As Double(),
	ByRef FTopArea As Double(),
	ByRef FTopAMin As Double(),
	ByRef FBotCombo As String(),
	ByRef FBotMoment As Double(),
	ByRef FBotArea As Double(),
	ByRef FBotAMin As Double(),
	ByRef AxialForce As Double(),
	ByRef VCombo As String(),
	ByRef VForce As Double(),
	ByRef VArea As Double(),
	ByRef Status As String(),
	ByRef GlobalX As Double(),
	ByRef GlobalY As Double(),
	ByRef Layer As String()
) As Integer
Dim instance As cDesignConcreteSlab
Dim StoryName As String()
Dim DesignStripName As String()
Dim Station As Double()
Dim ConcWidth As Double()
Dim FTopCombo As String()
Dim FTopMoment As Double()
Dim FTopArea As Double()
Dim FTopAMin As Double()
Dim FBotCombo As String()
Dim FBotMoment As Double()
Dim FBotArea As Double()
Dim FBotAMin As Double()
Dim AxialForce As Double()
Dim VCombo As String()
Dim VForce As Double()
Dim VArea As Double()
Dim Status As String()
Dim GlobalX As Double()
Dim GlobalY As Double()
Dim Layer As String()
Dim returnValue As Integer
returnValue = instance.GetFlexureAndShear(StoryName,
	DesignStripName, Station, ConcWidth,
	FTopCombo, FTopMoment, FTopArea,
	FTopAMin, FBotCombo, FBotMoment,
	FBotArea, FBotAMin, AxialForce, VCombo,
	VForce, VArea, Status, GlobalX, GlobalY,
	Layer)
int GetFlexureAndShear(
	array<String^>^% StoryName,
	array<String^>^% DesignStripName,
	array<double>^% Station,
	array<double>^% ConcWidth,
	array<String^>^% FTopCombo,
	array<double>^% FTopMoment,
	array<double>^% FTopArea,
	array<double>^% FTopAMin,
	array<String^>^% FBotCombo,
	array<double>^% FBotMoment,
	array<double>^% FBotArea,
	array<double>^% FBotAMin,
	array<double>^% AxialForce,
	array<String^>^% VCombo,
	array<double>^% VForce,
	array<double>^% VArea,
	array<String^>^% Status,
	array<double>^% GlobalX,
	array<double>^% GlobalY,
	array<String^>^% Layer
)
abstract GetFlexureAndShear :
        StoryName : string[] byref *
        DesignStripName : string[] byref *
        Station : float[] byref *
        ConcWidth : float[] byref *
        FTopCombo : string[] byref *
        FTopMoment : float[] byref *
        FTopArea : float[] byref *
        FTopAMin : float[] byref *
        FBotCombo : string[] byref *
        FBotMoment : float[] byref *
        FBotArea : float[] byref *
        FBotAMin : float[] byref *
        AxialForce : float[] byref *
        VCombo : string[] byref *
        VForce : float[] byref *
        VArea : float[] byref *
        Status : string[] byref *
        GlobalX : float[] byref *
        GlobalY : float[] byref *
        Layer : string[] byref -> int
Parameters
StoryName
Type: System.String[]
DesignStripName
Type: System.String[]
Station
Type: System.Double[]
ConcWidth
Type: System.Double[]
FTopCombo
Type: System.String[]
FTopMoment
Type: System.Double[]
FTopArea
Type: System.Double[]
FTopAMin
Type: System.Double[]
FBotCombo
Type: System.String[]
FBotMoment
Type: System.Double[]
FBotArea
Type: System.Double[]
FBotAMin
Type: System.Double[]
AxialForce
Type: System.Double[]
VCombo
Type: System.String[]
VForce
Type: System.Double[]
VArea
Type: System.Double[]
Status
Type: System.String[]
GlobalX
Type: System.Double[]
GlobalY
Type: System.Double[]
Layer
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignConcreteSlab Interface
ETABSv1 Namespace